package com.fyodorov.lesson4.task1;
/**
 * Класс {@code Task1} Написать программу для поиска минимального из двух чисел.
 * @author Alexandr Fyodorov
 */
public class Task1 {
    public static void main(String[] args) {
        int a = 2;
        int b = 4;
        if(a<b){
            System.out.println("a меньше b");
        }
        else{
            System.out.println("a больше b");
        }
    }
}
